/*━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	ヘッダーファイル取り込み
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━*/
/*┌─────────┐
　│System Information│
　└─────────┘*/
/* nothing */
/*┌────────────┐
　│Environment Information │
　└────────────┘*/
#include "../../Common/Common.h"		/* Common Information	*/
#include "../../Platform/Platform.h"		/* Platform Information	*/

/*┌────────┐
　│User Information│
　└────────┘*/
#include "./Platform/SPIPlatform.h"		/* 機種依存機能のヘッダ		*/
#include "./SPI.h"

/*━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	外部変数定義と外部変数へのリンク　[External Linkage]
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━*/
/* nothing */

/*━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	内部変数定義　[Internal Linkage]
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━*/
/* nothing */

/*━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	内部関数プロトタイプ宣言　[Internal Linkage]
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━*/
/* nothing */

/*━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	外部関数定義(public)　[External Linkage]
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━*/
/*********************************************************************
	funcname: SPI_execResume
	contents: SPIドライバのResume処理をする
	引    数: なし
	返    値: なし
	備    考: プラットホームの使用ポート初期化
*********************************************************************/
public void
SPI_execResume(unsigned char ch)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	/* nothing */
	
	/*************************************************************
		SPIドライバ 動作禁止 処理(プラットホーム)
	*************************************************************/
	SPIP_disable(ch);
	SPIP_execResume(ch);
}

/*********************************************************************
	funcname: SPI_suspend
	contents: SPIドライバのSuspend処理をする
	引    数: なし
	返    値: なし
	備    考: なし
*********************************************************************/
public void
SPI_execSuspend(unsigned char ch)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	/* nothing */
	
	/*************************************************************
		SPIドライバ 動作禁止 処理(プラットホーム)
	*************************************************************/
	SPIP_disable(ch);
	SPIP_execSuspend(ch);
}

/*********************************************************************
	funcname: SPI_enable
	contents: SPIドライバの動作を許可する
	引    数: なし
	返    値: なし
	備    考: MPUのSPIドライバ機能を有効にするだけにしました。
		  その代わり､イネーブル後の最初のデータ転送の際(SPI_transmitData)、
		  バスがＳＰかどうかチェックするところで引っかかるので、そこで
		  ＳＰを生成してバスを開放することにします。
*********************************************************************/
public void
SPI_enable(unsigned char ch)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	/* nothing */
	
	/*************************************************************
		SPIドライバ 動作許可 処理(プラットホーム)
	*************************************************************/
	SPIP_enable(ch);
}

/*********************************************************************
	funcname: SPI_disable
	contents: SPIドライバの動作を停止する
	引    数: なし
	返    値: なし
	備    考: なし
*********************************************************************/
public void
SPI_disable(unsigned char ch)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	/* nothing */
	
	/*************************************************************
		SPIドライバ 動作禁止 処理(プラットホーム)
	*************************************************************/
	SPIP_disable(ch);
}
/*********************************************************************
	funcname: SPI_changeEdge
	contents: SPIドライバの動作を停止する
	引    数: unsigned char ch
				unsigned char edge
					0: rising edge sample
					1: falling edge sample
	返    値: なし
	備    考: なし
*********************************************************************/
public void
SPI_changeEdge(unsigned char ch,unsigned char edge)
{
	SPIP_changeEdge(ch,edge);
}

/*********************************************************************
	funcname: SPI_transmitData
	contents: データ送信を行う
	引    数: unsigned char ch, unsigned char Data
	返    値: 0: ok
		 
	備    考: 送信データ先頭はスレーブアドレスとする
		  SPIスレーブの電源を入れてから安定するまで時間が
		  かかります(1msec位)。そのため、電源投入後10msec位
		  たった後にこの関数を呼んでください。
*********************************************************************/
public unsigned char
SPI_transmitData(unsigned char ch, unsigned char Data)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	unsigned char			result = 0;		/* エラーの有無情報 */

	SPIP_transmitByte(ch,Data);
	result = 0;
	
	return result;					/* エラー情報を返す		*/
}
/*********************************************************************
	funcname: SPI_transmitData
	contents: データ送信を行う
	引    数: byteNum : 送信データ数
		  pdata   : 送信データ先頭へのポインタ
	返    値: 0: ok
		 
	備    考: 送信データ先頭はスレーブアドレスとする
		  SPIスレーブの電源を入れてから安定するまで時間が
		  かかります(1msec位)。そのため、電源投入後10msec位
		  たった後にこの関数を呼んでください。
*********************************************************************/
public signed char
SPI_receiveData(unsigned char ch, unsigned char *Data)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	char			result = 0;		/* エラーの有無情報 */

	if(NULL != Data)
	{
		*Data = SPIP_ReceiveByte(ch);
		result = 0;
	}
	else
	{
		result = -1;
	}
	
	
	return result;					/* エラー情報を返す		*/
}

/*━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	外部関数定義(package)　[External Linkage]
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━*/
/* nothing */

/*━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	内部関数定義　[Internal Linkage]
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━*/
/* nothing */
